app/Controllers/RestPersonas.php

    public function index()
    {
        $model = new PersonasModel();
        return $this->respond($model->findAll());
---
SELECT *
FROM `personas`

    public function show($id = null)
    {
        $model = new PersonasModel();
        $data = $model->find($id);
---
SELECT *
FROM `personas`
WHERE `personas`.`id` = '19'

    public function create()
    {
        $model = new PersonasModel();
        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'edad' => $this->request->getPost('edad'),
            'correo' => $this->request->getPost('correo')
        ];

        $data = $this->request->getJSON();

        $model->insert($data);
---
INSERT INTO `personas` (`nombre`, `apellido`, `edad`, `correo`) VALUES ('José', 'García', '28', 'jose_garcia@hotmail.com')